module Two where

data B2ₗ : Set where
    ₀₀ : B2ₗ
    ₁₀ : B2ₗ

data B2ᵣ : Set where
    ₀₀ : B2ᵣ
    ₀₁ : B2ᵣ

_∧ₗ_ : B2ₗ → B2ₗ → B2ₗ
₀₀ ∧ₗ ₀₀ = ₀₀
₀₀ ∧ₗ ₁₀ = ₀₀
₁₀ ∧ₗ ₀₀ = ₀₀
₁₀ ∧ₗ ₁₀ = ₁₀

_∨ₗ_ : B2ₗ → B2ₗ → B2ₗ
₀₀ ∨ₗ ₀₀ = ₀₀
₀₀ ∨ₗ ₁₀ = ₁₀
₁₀ ∨ₗ ₀₀ = ₁₀
₁₀ ∨ₗ ₁₀ = ₁₀

¬ₗ : B2ₗ → B2ₗ 
¬ₗ ₀₀ = ₁₀
¬ₗ ₁₀ = ₀₀

_⊔ₗ_ : B2ₗ → B2ₗ → B2ₗ
₀₀ ⊔ₗ ₀₀ = ₀₀
₀₀ ⊔ₗ ₁₀ = ₁₀
₁₀ ⊔ₗ ₀₀ = ₁₀
₁₀ ⊔ₗ ₁₀ = ₁₀

_∧ᵣ_ : B2ᵣ → B2ᵣ → B2ᵣ
₀₀ ∧ᵣ ₀₀ = ₀₀
₀₀ ∧ᵣ ₀₁ = ₀₁
₀₁ ∧ᵣ ₀₀ = ₀₁
₀₁ ∧ᵣ ₀₁ = ₀₁

_∨ᵣ_ : B2ᵣ → B2ᵣ → B2ᵣ
₀₀ ∨ᵣ ₀₀ = ₀₀
₀₀ ∨ᵣ ₀₁ = ₀₀
₀₁ ∨ᵣ ₀₀ = ₀₀
₀₁ ∨ᵣ ₀₁ = ₀₁

¬ᵣ : B2ᵣ → B2ᵣ
¬ᵣ ₀₀ = ₀₁
¬ᵣ ₀₁ = ₀₀ 

_⊔ᵣ_ : B2ᵣ → B2ᵣ → B2ᵣ
₀₀ ⊔ᵣ ₀₀ = ₀₀
₀₀ ⊔ᵣ ₀₁ = ₀₁
₀₁ ⊔ᵣ ₀₀ = ₀₁
₀₁ ⊔ᵣ ₀₁ = ₀₁